In [11]:
#series

import pandas as pd

temp = pd.Series([-20, -10, 10, 20], index = ['Jan', 'Feb', 'Mar', 'Apr'])
temp

Jan   -20
Feb   -10
Mar    10
Apr    20
dtype: int64

In [26]:
#Data Frame
import pandas as pd


data = {
    'Uni' : ['Kyushu', 'Seoul', 'Tokyo'], 'Conpany' : ['LGinnotek', 'Samsung Electrics', 'SK hynics'], 'name' : ['Rhodamine', 'Ted', 'Hines']
}

#df stands for data frame
df = pd.DataFrame(data, index = ['Student1', 'Student2', 'Student3'], columns = ['name', 'Uni'])

df

               name     Uni
Student1  Rhodamine  Kyushu
Student2        Ted   Seoul
Student3      Hines   Tokyo

In [20]:
#index

#Data Frame
import pandas as pd


data = {
    'Uni' : ['Kyushu', 'Seoul', 'Tokyo'], 'Conpany' : ['LGinnotek', 'Samsung Electrics', 'SK hynics'], 'name' : ['Rhodamine', 'Ted', 'Hines']
}

#df stands for data frame
df = pd.DataFrame(data, index = ['Student1', 'Student2', 'Student3'])

#reset
# df.index.name = 'students information'
# df.reset_index()

#reset and get rid of previous index
# df.index.name = 'students information'
# df.reset_index(drop=True, inplace=True)

#setting uni as the index
#inplace = setting those data as real data
# df.set_index('Uni', inplace=True)
# df

#sorting

df.set_index('Uni', inplace=True)
df.sort_index()

                  Conpany       name
Uni
Kyushu          LGinnotek  Rhodamine
Seoul   Samsung Electrics        Ted
Tokyo           SK hynics      Hines

In [27]:
#File reading and writting

#writting
# import pandas as pd

# data = {
#     'Uni' : ['Kyushu', 'Seoul', 'Tokyo'], 'Conpany' : ['LGinnotek', 'Samsung Electrics', 'SK hynics'], 'name' : ['Rhodamine', 'Ted', 'Hines']
# }

# df = pd.DataFrame(data, index = ['Student1', 'Student2', 'Student3'])

# df.to_csv('information.csv')

#reading

import pandas as pd

df = pd.read_excel('OS test sorter.xlsx', skiprows = 1, nrows = 10)

df

   Unnamed: 0  OS1  Unnamed: 2
0         NaN  D0N       0.234
1         NaN  D0P       0.234
2         NaN  D1N       0.234
3         NaN  D1P       0.234
4         NaN  NaN         NaN
5         NaN  OS2         NaN
6         NaN  D0N       0.234
7         NaN  D0P       0.234
8         NaN  D1N       0.234
9         NaN  D1P       0.234